runfile('.//Code//Coordination.py')
fuhao = Coordination('Origin-data-fuhao',('膝关节屈曲 右,deg','膝关节屈曲 右,deg','膝关节屈曲 左,deg',
'膝关节屈曲 左,deg','膝关节屈曲 右,deg','膝关节屈曲 右,deg','膝关节屈曲 左,deg','膝关节屈曲 左,deg',
'膝关节屈曲 右,deg','膝关节屈曲 右,deg'),(7,7,8,8,7,7,7,7,7,7),(40,70,90,120,70,70,110,70,60,90))
dong = Coordination('Origin-data-dongwenchao',('膝关节屈曲 右,deg','膝关节屈曲 右,deg','膝关节屈曲 左,deg',
'膝关节屈曲 左,deg','膝关节屈曲 右,deg','膝关节屈曲 右,deg','膝关节屈曲 左,deg','膝关节屈曲 左,deg',
'膝关节屈曲 右,deg','膝关节屈曲 右,deg'),(9,6, 6, 8,   7, 7,    9,7  ,10,8),
(40,40,60,110,  50,40,   120,100,100,70))
dujin = Coordination('Origin-data-dujin',('膝关节屈曲 右,deg','膝关节屈曲 右,deg','膝关节屈曲 左,deg',
'膝关节屈曲 左,deg','肩屈曲 右,deg','肩屈曲 右,deg','膝关节屈曲 左,deg',
'膝关节屈曲 左,deg','膝关节屈曲 右,deg','膝关节屈曲 右,deg'),(7,8, 8, 8,  8, 8,    10, 9,  10,10),
(100,100,100,120,210,150, 130,120,  115,80))
#

